/*------------------------------------------------------------------------------
	Lib.h
	プログラムの補助関数を扱う関数
--------------------------------------------------------------------------------*/

// これをしておくと多重定義がなくなる --
#ifndef __LIB_H_
#define __LIB_H_

// マウスのスクリーン座標の取得関数
extern	void GetMousePosition( HWND hwnd, POINT *pos );

// ラインを描画する関数
extern	void LineDisp( HDC hdc, int sx, int sy, int dx, int dy, COLORREF color );

// 終了
#endif

/*------------------------------------------------------------------------------
	Lib.h		End of File
--------------------------------------------------------------------------------*/
